
 [
    {
        "id": 1,
        "name": "Introduction to Algorithms",
        "description": "Learn fundamental algorithms and problem-solving techniques. This course covers a wide range of algorithms and data structures, equipping you with the knowledge and skills to tackle complex computational problems.",
        "price": 299,
        "credits": 3,
        "image": "https://i.ibb.co/D4rvf5G/algo.png"
    },
    {
        "id": 2,
        "name": "Data Structure",
        "description": "Explore data structures and their applications in programming. This course delves into various data structures such as arrays, linked lists, trees, and graphs, along with practical implementation in coding.",
        "price": 249,
        "credits": 2,
        "image": "https://i.ibb.co/ysDs0zD/data.png"
    },
    {
        "id": 3,
        "name": "Introduction to OOP Python",
        "description": "Introduction to object-oriented programming using Python. Discover the principles of OOP and how to apply them in Python, enabling you to write efficient and modular code.",
        "price": 199,
        "credits": 2,
        "image": "https://i.ibb.co/Wg8dsj5/python.png"
    },
    {
        "id": 4,
        "name": "Software Engineering",
        "description": "Discover software development methodologies and best practices. This comprehensive course covers the software development lifecycle, agile methodologies, and industry-standard tools.",
        "price": 349,
        "credits": 3,
        "image": "https://i.ibb.co/ZztLk4m/soft.png"
    },
    {
        "id": 5,
        "name": "AWS Cloud Computing",
        "description": "Learn cloud computing using Amazon Web Services (AWS). Explore cloud services, deployment strategies, and how to build scalable and reliable applications on the AWS platform.",
        "price": 399,
        "credits": 4,
        "image": "https://i.ibb.co/ScLz8CX/aws.png"
    },
    {
        "id": 6,
        "name": "Database (MySQL)",
        "description": "Explore database management with MySQL. This course covers database design, SQL queries, and practical hands-on experience with MySQL database systems.",
        "price": 199,
        "credits": 2,
        "image": "https://i.ibb.co/Hgmr3cH/mysql.png"
    },
    {
        "id": 7,
        "name": "Problem-Solving",
        "description": "Enhance your problem-solving skills and critical thinking. Develop your ability to approach complex problems systematically, analyze them, and find effective solutions.",
        "price": 149,
        "credits": 1,
        "image": "https://i.ibb.co/JQFXmTn/prob.png"
    },
    {
        "id": 8,
        "name": "Introduction to C++ for DSA",
        "description": "Introduction to C++ for data structures and algorithms. This course provides an in-depth understanding of C++ programming for implementing data structures and algorithms.",
        "price": 249,
        "credits": 2,
        "image": "https://i.ibb.co/85Hd43f/programib c++.png"
    },
    {
        "id": 9,
        "name": "Introduction to C Programming",
        "description": "Learn the fundamentals of C programming language. This course covers C syntax, data types, and programming techniques, making it ideal for beginners in programming.",
        "price": 179,
        "credits": 2,
        "image": "https://i.ibb.co/kKxBP4j/programin c.png"
    }
]
